# --*-- coding=utf-8 --*--
"""
    n与n+1 互质
    因此n(n+1)/2 的因子个数可看作两部分之积
    D(t) = D(n/2) * D(n+1) if n is even
    or D(t) = D(n) * D((n+1)/2)i if n+1 is even

    这样做不仅可以加快算法速度，还可以缩短所需要素数表的长度

    算法速度的渐近确界：
    算法速度的上界：
    算法速度的下界：

    mimose 2018.8.7
"""

primestable = [2,3,5,7,11,13,17,19,23,29 , 31 , 37 , 41 , 43 , 47 , 53 , 59 ,
               61 , 67 , 71 , 73 , 79 , 83 , 89 , 97 , 101 , 103 , 107 , 109 ,
               113 , 127 , 131 , 137 , 139 , 149 , 151 , 157 , 163 , 167 , 173
               , 179 , 181 , 191 , 193 , 197 , 199 , 211 , 223 , 227 , 229 ,
               233 , 239 , 241 , 251 , 257 , 263 , 269 , 271 , 277 , 281 , 283
               , 293 , 307 , 311 , 313 , 317 , 331 , 337 , 347 , 349 , 353 ,
               359 , 367 , 373 , 379 , 383 , 389 , 397 , 401 , 409 , 419 , 421
               , 431 , 433 , 439 , 443 , 449 , 457 , 461 , 463 , 467 , 479 ,
               487 , 491 , 499 , 503 , 509 , 521 , 523 , 541 , 547 , 557 ,
               547,557 , 563 , 569 , 571 , 577 , 587 , 593 , 599 , 601 , 607 ,
               613 , 617 , 619 , 631 , 641 , 643 , 647 , 653 , 659 , 661 , 673
               , 677 , 683 , 691 , 701 , 709 , 719 , 727 , 733 , 739 , 743 ,
               751 , 757 , 761 , 769 , 773 , 787 , 797 , 809 , 811 , 821 , 823
               , 827 , 829 , 839 , 853 , 857 , 859 , 863 , 877 , 881 , 883 ,
               887 , 907 , 911 , 919 , 929 , 937 , 941 , 947 , 953 , 967 , 971
               , 977 , 983 , 991 , 997]

def get_factor_num(t):
    tablelen = len(primestable)
    result = 1
    for index in range(0,tablelen):
        if t <= 1:
            break
        exponent = 0
        while t % primestable[index] == 0:
            t /= primestable[index]
            exponent +=1
        result = result * (exponent + 1)
    return result

x = 1    
while True:
    factornum = 1
    if x % 2 == 0:
        factornum = get_factor_num(x/2) * get_factor_num(x+1)
    else:
        factornum = get_factor_num(x) * get_factor_num((x+1)/2) 
    if factornum > 2000:
        print (x,(x*(x+1))/2)
        break
    x += 1
